# Задание No2
# Вводятся два списка чисел, которые могут содержать до 100000 чисел
# каждый. Все числа каждого списка находятся на отдельной строке. Выведите,
# сколько чисел содержится одновременно как в первом списке, так и во
# втором.
#
# https://github.com/A-l-E-v/PySynergy/blob/main/U-9/2lists.py
#

print()
print('--- Два списка ---')
print()