# Задание No3
# Во входную строку вводится последовательность чисел через пробел. Для
# каждого числа выведите слово ”YES” (в отдельной строке), если это число
# ранее встречалось в последовательности или ”NO”, если не встречалось.
#
# https://github.com/A-l-E-v/PySynergy/blob/main/U-9/sequence.py
#

print()
print('--- Последовательность чисел ---')
print()
